var express = require('express')
var router = express.Router()
var mongoose = require('mongoose')
var request = require('request')
var cheerio = require('cheerio')
var Cafe = require('../../model/cafe')
var suggestion = require('./suggestion/suggestion')
var googleMapsClient = require('@google/maps').createClient({
  key: 'AIzaSyBNTjHJ-wYRN_p9x7HMJu-_sI2LG-kzVj4'
})

router.use('/suggestion', suggestion)

// 크롤링 강남구 카페 DB
router.get('/cafe', function(req, res) {
  var gangnamGu1 = ["강남구+카페", "역삼동+카페", "개포동+카페", "청담동+카페", "삼성동+카페", "대치동+카페", "신사동+카페", "논현동+카페", "압구정동+카페", "세곡동+카페", "자곡동+카페", "율현동+카페", "일원동+카페", "수서동+카페", "도곡동+카페", "논현1동+카페", "논현2동+카페"]
  var gangnamGu2 = ["삼성1동+카페", "삼성2동+카페", "대치1동+카페", "대치2동+카페", "대치4동+카페", "역삼1동+카페", "역삼2동+카페", "도곡1동+카페", "도곡2동+카페", "개포1동+카페", "개포2동+카페", "개포4동+카페", "일원본동+카페", "일원1동+카페", "일원2동+카페"]
  var seochoGu1 = ["서초구+카페", "방배동+카페", "양재동+카페", "우면동+카페", "원지동+카페", "잠원동+카페", "반포동+카페", "서초동+카페", "내곡동+카페", "염곡동+카페", "신원동+카페", "서초1동+카페", "서초2동+카페", "서초3동+카페"]
  var seochoGu2 = ["서초4동+카페", "반포본동+카페", "반포1동+카페", "반포2동+카페", "반포3동+카페", "반포4동+카페", "방배본동+카페", "방배1동+카페", "방배2동+카페", "방배3동+카페", "방배4동+카페", "양재1동+카페", "양재2동+카페"]
  var songpaGu1 = ["송파구+카페", "잠실동+카페", "신천동+카페", "풍납동+카페", "송파동+카페", "석촌동+카페", "삼전동+카페", "가락동+카페", "문정동+카페", "장지동+카페", "방이동+카페", "오금동+카페", "거여동+카페", "마천동+카페", "풍납1동+카페", "풍납2동+카페", "거여1동+카페", "거여2동+카페", "마천1동+카페"]
  var songpaGu2 = ["마천2동+카페", "방이1동+카페", "방이2동+카페", "오륜동+카페", "송파1동+카페", "송파2동+카페", "가락본동+카페", "가락1동+카페", "가락2동+카페", "문정1동+카페", "문정2동+카페", "위례동+카페", "잠실본동+카페", "잠실2동+카페", "잠실3동+카페", "잠실4동+카페", "잠실6동+카페", "잠실7동+카페"]
  var gangdongGu = ["강동구+카페", "명일동+카페", "고덕동+카페", "상일동+카페", "길동+카페", "둔촌동+카페", "암사동+카페", "성내동+카페", "천호동+카페", "강일동+카페", "명일1동+카페", "명일2동+카페", "고덕1동+카페", "고덕2동+카페", "암사1동+카페", "암사2동+카페", "암사3동+카페", "천호1동+카페", "천호2동+카페", "천호3동+카페", "성내1동+카페", "성내2동+카페", "성내3동+카페", "둔촌1동+카페", "둔촌2동+카페"]
  var gwanakGu = ["관악구+카페", "봉천동+카페", "신림동+카페", "남현동+카페", "보라매동+카페", "청림동+카페", "성현동+카페", "행운동+카페", "낙성대동+카페", "청룡동+카페", "은천동+카페", "중앙동+카페", "인헌동+카페", "서원동+카페", "신원동+카페", "서림동+카페", "난항동+카페", "조원동+카페", "대학동+카페", "미성동+카페", "난곡동+카페"]
  var dongjakGu = ["동작구+카페", "노량진동+카페", "상도동+카페", "상도1동+카페", "본동+카페", "흑석동+카페", "동작동+카페", "사당동+카페", "대방동+카페", "신대방동+카페", "노량진1동+카페", "노량진2동+카페", "상도2동+카페", "상도3동+카페", "상도4동+카페", "사당1동+카페", "사당2동+카페", "사당3동+카페", "사당4동+카페", "사당5동+카페", "신대방1동+카페", "신대방2동+카페"]
  var yeongdeungpoGu1 = ["영등포구+카페", "영등포동+카페", "영등포동1가+카페", "영등포동2가+카페", "영등포동3가+카페", "영등포동4가+카페", "영등포동5가+카페", "영등포동6가+카페", "영등포동7가+카페", "영등포동8가+카페", "여의도동+카페", "당산동1가+카페", "당산동2가+카페"]
  var yeongdeungpoGu2 = ["당산동3가+카페", "당산동4가+카페", "당산동5가+카페", "당산동6가+카페", "당산동+카페", "도림동+카페", "문래동1가+카페", "문래동2가+카페", "문래동3가+카페", "문래동4가+카페", "문래동5가+카페", "문래동6가+카페", "양평동1가+카페", "양평동2가+카페"]
  var yeongdeungpoGu3 = ["양평동3가+카페", "양평동4가+카페", "양평동5가+카페", "양평동6가+카페", "양화동+카페", "신길동+카페", "대림동+카페", "양평동+카페", "영등포본동+카페", "여의동+카페", "당산1동+카페", "당산2동+카페", "문래동+카페", "양평1동+카페", "양평2동+카페"]
  var yeongdeungpoGu4 = [ "신길1동+카페", "신길3동+카페", "신길4동+카페", "신길5동+카페", "신길6동+카페", "신길7동+카페", "대림1동+카페", "대림2동+카페", "대림3동+카페"]
  var geumcheonGu = ["금천구+카페", "가산동+카페", "독산동+카페", "시흥동+카페", "독산1동+카페", "독산2동+카페", "독산3동+카페", "독산4동+카페", "시흥1동+카페", "시흥2동+카페", "시흥3동+카페", "시흥4동+카페", "시흥5동+카페"]
  var guroGu = ["구로구+카페", "신도림동+카페", "구로동+카페", "가리봉동+카페", "고척동+카페", "개봉동+카페", "오류동+카페", "궁동+카페", "온수동+카페", "천왕동+카페", "항동+카페", "구로1동+카페", "구로2동+카페", "구로3동+카페", "구로4동+카페", "구로5동+카페", "고척1동+카페", "고척2동+카페", "개봉1동+카페", "개봉2동+카페", "개봉3동+카페", "오류1동+카페", "오류2동+카페", "수궁동+카페"]
  var gangseoGu1 = ["강서구+카페", "염창동+카페", "등촌동+카페", "화곡동+카페", "가양동+카페", "마곡동+카페", "내발산동+카페", "외발산동+카페", "공항동+카페", "방화동+카페", "개화동+카페", "과해동+카페", "오곡동+카페", "오쇠동+카페", "등촌1동+카페", "등촌2동+카페", "등촌3동+카페", "화곡1동+카페"]
  var gangseoGu2 = ["화곡2동+카페", "화곡3동+카페", "화곡4동+카페", "화곡본동+카페", "화곡6동+카페", "화곡8동+카페", "가양1동+카페", "가양2동+카페", "가양3동+카페", "발산1동+카페", "우장산동+카페", "방화1동+카페", "방화2동+카페", "방화3동+카페"]
  var yangcheonGu = ["양천구+카페", "신정동+카페", "목동+카페", "신월동+카페", "목1동+카페", "목2동+카페", "목3동+카페", "목4동+카페", "목5동+카페", "신월1동+카페", "신월2동+카페", "신월3동+카페", "신월4동+카페", "신월5동+카페", "신월6동+카페", "신월7동+카페", "신정1동+카페", "신정2동+카페", "신정3동+카페", "신정4동+카페", "신정6동+카페", "신정7동+카페"]
  var mapoGu1 = ["마포구+카페", "아현동+카페", "공덕동+카페", "신공덕동+카페", "도화동+카페", "용강동+카페", "토정동+카페", "마포동+카페", "대흥동+카페", "염리동+카페", "노고산동+카페", "신수동+카페", "현석동+카페", "구수동+카페", "창전동+카페", "상수동+카페", "하중동+카페"]
  var mapoGu2 = ["신정동+카페", "당인동+카페", "서교동+카페", "동교동+카페", "합정동+카페", "망원동+카페", "연남동+카페", "성산동+카페", "중동+카페", "상암동+카페", "서강동+카페", "망원1동+카페", "망원2동+카페", "성산1동+카페", "성산2동+카페"]
  var seodaemunGu1 = ["서대문구+카페", "충정로2가+카페", "충정로3가+카페", "합동+카페", "미근동+카페", "냉천동+카페", "천연동+카페", "옥천동+카페", "영천동+카페", "현저동+카페", "북아현동+카페", "홍제동+카페", "대현동+카페", "대신동+카페", "신촌동+카페", "봉원동+카페"]
  var seodaemunGu2 = ["창천동+카페", "연희동+카페", "홍은동+카페", "북가좌동+카페", "남가좌동+카페", "충현동+카페", "홍제1동+카페", "홍제3동+카페", "홍제2동+카페", "홍은1동+카페", "홍은2동+카페", "남가좌1동+카페", "남가좌2동+카페", "북가좌1동+카페", "북가좌2동+카페"]
  var eunpyeongGu = ["은평구+카페", "수색동+카페", "녹번동+카페", "불광동+카페", "갈현동+카페", "구산동+카페", "대조동+카페", "응암동+카페", "역촌동+카페", "증산동+카페", "진관동+카페", "불광1동+카페", "불광2동+카페", "갈현1동+카페", "갈현2동+카페", "응암1동+카페", "응암2동+카페", "응암3동+카페", "신사1동+카페", "신사2동+카페"]
  var nowonGu1 = ["노원구+카페", "월계동+카페", "공릉동+카페", "하계동+카페", "상계동+카페", "중계동+카페", "월계1동+카페", "월계2동+카페", "월계3동+카페", "공릉1동+카페", "공릉2동+카페", "하계1동+카페", "하계2동+카페", "중계본동+카페", "중계1동+카페", "중계4동+카페"]
  var nowonGu2 = ["중계2.3동+카페", "상계1동+카페", "상계2동+카페", "상계3.4동+카페", "상계5동+카페", "상계6.7동+카페", "상계8동+카페", "상계9동+카페", "상계10동+카페"]
  var dobongGu = ["도봉구+카페", "쌍문동+카페", "방학동+카페", "창동+카페", "도봉동+카페", "창1동+카페", "창2동+카페", "창3동+카페", "창4동+카페", "창5동+카페", "도봉1동+카페", "도봉2동+카페", "쌍문1동+카페", "쌍문2동+카페", "쌍문3동+카페", "쌍문4동+카페", "방학1동+카페", "방학2동+카페", "방학3동+카페"]
  var gangbukGu = ["강북구+카페", "미아동+카페", "번동+카페", "수유동+카페", "우이동+카페", "삼양동+카페", "송중동+카페", "송천동+카페", "삼각산동+카페", "번1동+카페", "번2동+카페", "번3동+카페", "수유1동+카페", "수유2동+카페", "수유3동+카페", "인수동+카페"]
  var seongbukGu1 = ["성북구+카페", "성북동+카페", "성북동1가+카페", "돈암동+카페", "동소문동1가+카페", "동소문동2가+카페", "동소문동3가+카페", "동소문동4가+카페", "동소문동5가+카페", "동소문동6가+카페", "동소문동7가+카페", "삼선동1가+카페", "삼선동2가+카페", "삼선동3가+카페", "삼선동4가+카페"]
  var seongbukGu2 = ["삼선동5가+카페", "동선동1가+카페", "동선동2가+카페", "동선동3가+카페", "동선동4가+카페", "동선동5가+카페", "안암동1가+카페", "안암동2가+카페", "안암동3가+카페", "안암동4가+카페", "안암동5가+카페", "보문동4가+카페", "보문동5가+카페", "보문동6가+카페", "보문동7가+카페"]
  var seongbukGu3 = ["보문동1가+카페", "보문동2가+카페", "보문동3가+카페", "정릉동+카페", "길음동+카페", "종암동+카페", "하월곡동+카페", "상월곡동+카페", "장위동+카페", "석관동+카페", "삼선동+카페", "동선동+카페", "돈암1동+카페", "돈암2동+카페", "안암동+카페", "보문동+카페"]
  var seongbukGu4 = ["정릉1동+카페", "정릉2동+카페", "정릉3동+카페", "정릉4동+카페", "길음1동+카페", "길음2동+카페", "월곡1동+카페", "월곡2동+카페", "장위1동+카페", "장위2동+카페", "장위3동+카페"]
  var jungnangGu1 = ["중랑구+카페", "면목동+카페", "상봉동+카페", "중화동+카페", "묵동+카페", "망우동+카페", "신내동+카페", "면목2동+카페", "면목4동+카페", "면목5동+카페", "면목본동+카페", "면목7동+카페"]
  var jungnangGu2 = ["면목3.8동+카페", "상봉1동+카페", "상봉2동+카페", "중화1동+카페", "중화2동+카페", "묵1동+카페", "묵2동+카페", "망우본동+카페", "망우3동+카페", "신내1동+카페", "신내2동+카페"]
  var dongdaemunGu1 = ["동대문구+카페", "신설동+카페", "용두동+카페", "제기동+카페", "전농동+카페", "답십리동+카페", "장안동+카페", "청량리동+카페", "회기동+카페", "휘경동+카페", "이문동+카페", "용신동+카페", "전농1동+카페", "전농2동+카페"]
  var dongdaemunGu2 = ["답십리1동+카페", "답십리2동+카페", "장안1동+카페", "장안2동+카페", "휘경1동+카페", "휘경2동+카페", "이문1동+카페", "이문2동+카페"]
  var gwangjinGu = ["광진구+카페", "중곡동+카페", "능동+카페", "구의동+카페", "광장동+카페", "자양동+카페", "화양동+카페", "군자동+카페", "중곡1동+카페", "중곡2동+카페", "중곡3동+카페", "중곡4동+카페", "자양1동+카페", "자양2동+카페", "자양3동+카페", "자양4동+카페", "구의1동+카페", "구의2동+카페", "구의3동+카페"]
  var seongdongGu1 = ["성동구+카페", "상왕십리동+카페", "하왕십리동+카페", "홍익동+카페", "도선동+카페", "마장동+카페", "사근동+카페", "행당동+카페", "응봉동+카페", "금호동1가+카페", "금호동2가+카페", "금호동3가+카페", "금호동4가+카페", "옥수동+카페", "성수동1가+카페"]
  var seongdongGu2 = ["성수동2가+카페", "송정동+카페", "용답동+카페", "왕십리2동+카페", "왕십리도선동+카페", "행당1동+카페", "행당2동+카페", "금호1가동+카페", "금호2.3가동+카페", "금호4가동+카페", "성수1가1동+카페", "성수1가2동+카페", "성수2가1동+카페", "성수2가3동+카페"]
  var yongsanGu1 = ["용산구+카페", "후암동+카페", "용산동2가+카페", "용산동4가+카페", "갈월동+카페", "남영동+카페", "용산동1가+카페", "동자동+카페", "서계동+카페", "청파동1가+카페", "청파동2가+카페", "청파동3가+카페", "원효로1가+카페", "원효로2가+카페", "신창동+카페"]
  var yongsanGu2 = ["산천동+카페", "청암동+카페", "원효로3가+카페", "원효로4가+카페", "효창동+카페", "도원동+카페", "용문동+카페", "문배동+카페", "신계동+카페", "한강로1가+카페", "한강로2가+카페", "용산동3가+카페", "용산동5가+카페", "한강로3가+카페", "이촌동+카페"]
  var yongsanGu3 = ["이태원동+카페", "한남동+카페", "동빙고동+카페", "서빙고동+카페", "주성동+카페", "용산동6가+카페", "보광동+카페", "용산2가동+카페", "청파동+카페", "원효로1동+카페", "원효로2동+카페", "한강로동+카페", "이촌1동+카페", "이촌2동+카페", "이태원1동+카페", "이태원2동+카페"]
  var jungGu1 = ["무교동+카페", "다동+카페", "태평로1가+카페", "을지로1가+카페", "을지로2가+카페", "남대문로1가+카페", "삼각동+카페", "수하동+카페", "장교동+카페", "수표동+카페", "소공동+카페", "남창동+카페", "북창동+카페", "태평로2가+카페", "남대문로2가+카페"]
  var jungGu2 = ["남대문로3가+카페", "남대문로4가+카페", "남대문로5가+카페", "봉래동1가+카페", "봉래동2가+카페", "회현동1가+카페", "회현동2가+카페", "회현동3가+카페", "충무로1가+카페", "충무로2가+카페", "명동1가+카페", "명동2가+카페", "남산동1가+카페", "남산동2가+카페"]
  var jungGu3 = ["남산동3가+카페", "저동1가+카페", "충무로4가+카페", "충무로5가+카페", "인현동2가+카페", "예관동+카페", "묵정동+카페", "필동1가+카페", "필동2가+카페", "필동3가+카페", "남학동+카페", "주자동+카페", "예장동+카페", "장충동1가+카페", "장충동2가+카페"]
  var jungGu4 = ["광희동1가+카페", "광희동2가+카페", "쌍림동+카페", "을지로6가+카페", "을지로7가+카페", "을지로4가+카페", "을지로5가+카페", "주교동+카페", "방산동+카페", "오장동+카페", "을지로3가+카페", "입정동+카페", "산림동+카페", "충무로3가+카페", "초동+카페", "인현동1가+카페"]
  var jungGu5 = ["저동2가+카페", "신당동+카페", "흥인동+카페", "무학동+카페", "황학동+카페", "서소문동+카페", "정동+카페", "순화동+카페", "의주로1가+카페", "충정로1가+카페", "중림동+카페", "의주로2가+카페", "만리동1가+카페", "만리동2가+카페", "회현동+카페", "명동+카페", "필동+카페"]
  var jungGu6 = ["장충동+카페", "광희동+카페", "을지로동+카페", "다산동+카페", "약수동+카페", "청구동+카페", "신당5동+카페", "동화동+카페"]
  var jongnoGu1 = ["종로구+카페", "청운동+카페", "신교동+카페", "궁정동+카페", "효자동+카페", "창성동+카페", "통의동+카페", "적선동+카페", "통인동+카페", "누상동+카페", "누하동+카페", "옥인동+카페", "체부동+카페", "필운동+카페", "내자동+카페", "사직동+카페", "도렴동+카페", "당주동+카페"]
  var jongnoGu2 = ["내수동+카페", "세종로+카페", "신문로1가+카페", "신문로2가+카페", "청진동+카페", "서린동+카페", "수송동+카페", "중학동+카페", "종로1가+카페", "공평동+카페", "관훈동+카페", "견지동+카페", "와룡동+카페", "권농동+카페", "운니동+카페", "익선동+카페", "경운동+카페"]
  var jongnoGu3 = ["관철동+카페", "인사동+카페", "낙원동+카페", "종로2가+카페", "팔판동+카페", "삼청동+카페", "안국동+카페", "소격동+카페", "화동+카페", "사간동+카페", "송현동+카페", "가회동+카페", "재동+카페", "계동+카페", "원서동+카페", "훈정동+카페", "묘동+카페", "봉익동+카페"]
  var jongnoGu4 = ["돈의동+카페", "장사동+카페", "관수동+카페", "종로3가+카페", "인의동+카페", "예지동+카페", "원남동+카페", "연지동+카페", "종로4가+카페", "효제동+카페", "종로5가+카페", "종로6가+카페", "이화동+카페", "연건동+카페", "충신동+카페", "동숭동+카페", "혜화동+카페", "명륜1가+카페"]
  var jongnoGu5 = ["명륜2가+카페", "명륜4가+카페", "명륜3가+카페", "창신동+카페", "숭인동+카페", "교남동+카페", "평동+카페", "송월동+카페", "홍파동+카페", "교북동+카페", "행촌동+카페", "구기동+카페", "평창동+카페", "부암동+카페", "홍지동+카페", "신영동+카페", "무악동+카페", "청운효자동+카페"]
  var jongnoGu6 = ["종로1.2.3.4가동+카페", "종로5.6가동+카페", "창신1동+카페", "창신2동+카페", "창신3동+카페", "숭인1동+카페", "숭인2동+카페"]

  gangnamGu2.forEach(function(val) {
    for(var i = 0; i <= 10; i++) {
      var url = "http://www.diningcode.com/list.php?page="+i+"&chunk=10&query=" + encodeURIComponent(val)
      request(url, function(err, res, body) {
        if(err) throw err
        var $ = cheerio.load(body)

        var cafe = $("div.dc-restaurant-name")
        // 카페 하나씩
        cafe.each(function() {
          var cafeUrl = "http://www.diningcode.com/" + $(this).find("a").attr("href")
          request(cafeUrl, function(err, res, body) {
            var $ = cheerio.load(body)
            var name = $("div#item-rn > span.item-rn-title").text()
            var keywords = []
            var category = []
            $("a.urlkeyword").each(function() {
              var keyword = $(this).text()
              categoryFunc(keyword, category)
              keywords.push(keyword)
            })
            var length = $("div.item-information-text").length-1
            var address = $("div:nth-child("+ length +") > div.item-information-text").text()
            var tel
            if($("div#item-tel > div.item-information-text").text().length > 1) {
              tel = $("div#item-tel > div.item-information-text").text()
            }
            if($("div.rest-time-block").length !== 0) {
              var hours = ""
              $("div.rest-time-block").each(function() {
                hours += $(this).find("div.rest-time-left").text()
                hours += ": " + $(this).find("div.rest-time-right > div.time").text() + "\n"
              })
            }
            var menu
            if($("div.rest-menu-block").length !== 0) {
              var menu = ""
              $("div.rest-menu-block").each(function() {
                menu += $(this).find("div.rest-menu-left").text()
                menu += " : " + $(this).find("div.rest-menu-right > div.time").text() + "\n"
              })
            }
            var imagesURL = []
            $("td#photo_empty_cell1").find("img").each(function() {
              if($(this).attr("b_id") !== "instagram" && $(this).attr("id").substring(1) <= 5) imagesURL.push($(this).attr("src"))
            })

            googleMapsClient.geocode({
              address: address
            }, function(err, res) {
              if(err) throw err

              var latitude = res.json.results[0].geometry.location.lat
              var longitude = res.json.results[0].geometry.location.lng

              Cafe.find({ "name": name, "address": address }, function(err, cafe) {
                if(err) throw err
                if(cafe.length === 0) {
                  var cafe = new Cafe()
                  cafe.name = name
                  cafe.address = address
                  cafe.tel = tel
                  cafe.hours = hours
                  cafe.keywords = keywords
                  cafe.menu = menu
                  cafe.imagesURL = imagesURL
                  cafe.category = category
                  cafe.location = [longitude, latitude]

                  cafe.save(function(err) {
                    if(err) throw err
                  })
                }
              })
            })
          })
        })
      })
    } // for
  }) // forEach
  res.json("강남구 완료")
})

// 카테고리화
function categoryFunc(keyword, category) {
  var obj = {
    "주차": ["전용주차장", "주차가능", "무료주차", "발렛"],
    "테라스": ["테라스", "정원", "야외"],
    "스터디": ["스터디", "공부", "편안한의자", "편한의자", "편한"],
    "편한의자": ["편한의자", "공부", "편안한의자", "스터디", "편한"],
    "모임": ["모임", "모임장소", "여자들끼리", "남자들끼리"],
    "24시": ["24시"],
    "미팅룸": ["미팅룸", "미팅", "룸식", "회의", "회의장", "룸", "단체석"],
    "디저트": ["디저트", "브런치", "케익", "케이크"],
    "로스팅": ["로스팅", "로스터리"],
    "넓은공간": ["넓은공간", "넓은테이블", "단체석"],
    "드라이브": ["드라이브", "모닥불", "산책로"],
    "산책로": ["산책로", "모닥불", "드라이브"],
    "모닥불": ["모닥불", "드라이브", "산책로"],
    "북카페": ["북", "만화"],
    "좌식": ["좌식", "좌식바"],
    "베이커리": ["베이커리", "빵집", "건강빵", "빵"],
    "연중무휴": ["연중무휴", "365일영업", "365"],
    "이색카페": ["이색카페", "이색"],
    "아이와함께": ["아이와함께", "아이와같이", "아이랑", "베이비체어", "놀이방"],
    "조용한": ["조용한", "차분한"],
    "고급스러운": ["고급스러운", "럭셔리", "고급", "고풍", "유럽풍", "세련된"],
    "여유로운": ["여유로운", "평화로운", "차분한", "한가한", "힐링"],
    "힐링": ["힐링", "평화로운", "차분한", "한가한", "여유로운"],
    "야경": ["야경"]
  }
  for(key in obj) {
    obj[key].forEach(function(str) {
      if(keyword.indexOf(str) !== -1) {
        var cat = category.filter(function(cat) { return key === cat })
        if(cat.length === 0) category.push(key)
      }
    })
  }
}

// 카페DB 중복검사
router.get('/test', function(req, res) {
  Cafe.find({}, function(err, cafes) {
    for(var i = 0; i < cafes.length; i++) {
      for(var j = i+1; j < cafes.length; j++) {
        if(cafes[i].address === cafes[j].address && cafes[i].name === cafes[j].name) {
          // cafes[j].remove(function(err, result) {
          //   // console.log(result)
          //   // console.log("중복있음", i, j, cafes[i].address)
          // })
          console.log("중복있음", i, j, cafes[i].address)
        }
      }
      // console.log('out', i, j)
    }
  })
  res.json("중복검사")
})

module.exports = router
